measurements/wsgi_benchmark_50_ms/worker_results.txt

2 workers
Running 50m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.66s    22.27ms   1.67s    99.94%
    Req/Sec     0.00      0.06    10.00     99.97%
  115868 requests in 50.00m, 37.90MB read
Requests/sec:     38.62
Transfer/sec:     12.94KB
latency_values:
{"Min": 52.917, "Max": 1671.667, "Avg": 1656.534, "Stdev": 22.271}
request_values:
{"Min": 0, "Max": 10, "Avg": 0, "Stdev": 0}
latency_distribution:
{"1%": 1655.375, "25%": 1656.428, "50%": 1656.908, "75%": 1657.461, "90%": 1658.025, "99%": 1659.512, "99.9%": 1660.821, "99.99%": 1671.460 }
percentiles:
{"percentiles": [ 1655.375, 1655.547, 1655.653, 1655.732, 1655.795, 1655.851, 1655.902, 1655.947, 1655.989, 1656.029, 1656.065, 1656.101, 1656.134, 1656.166, 1656.194, 1656.222, 1656.247, 1656.272, 1656.297, 1656.320, 1656.343, 1656.365, 1656.387, 1656.408, 1656.428, 1656.449, 1656.470, 1656.489, 1656.508, 1656.528, 1656.547, 1656.566, 1656.585, 1656.604, 1656.623, 1656.642, 1656.661, 1656.679, 1656.698, 1656.716, 1656.736, 1656.755, 1656.773, 1656.793, 1656.812, 1656.831, 1656.850, 1656.869, 1656.888, 1656.908, 1656.928, 1656.946, 1656.965, 1656.984, 1657.003, 1657.023, 1657.042, 1657.062, 1657.082, 1657.102, 1657.124, 1657.145, 1657.167, 1657.190, 1657.213, 1657.237, 1657.259, 1657.282, 1657.307, 1657.331, 1657.357, 1657.383, 1657.408, 1657.435, 1657.461, 1657.490, 1657.518, 1657.548, 1657.578, 1657.611, 1657.644, 1657.679, 1657.716, 1657.756, 1657.793, 1657.834, 1657.877, 1657.924, 1657.973, 1658.025, 1658.085, 1658.151, 1658.233, 1658.322, 1658.434, 1658.570, 1658.752, 1659.027, 1659.512, 1671.667]}

4 workers
Running 30m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   828.57ms   10.08ms 835.02ms   99.95%
    Req/Sec     1.00      0.06    10.00     99.98%
  138986 requests in 30.00m, 45.46MB read
Requests/sec:     77.21
Transfer/sec:     25.86KB
latency_values:
{"Min": 53.187, "Max": 835.022, "Avg": 828.569, "Stdev": 10.081}
request_values:
{"Min": 1, "Max": 10, "Avg": 1, "Stdev": 0}
latency_distribution:
{"1%": 826.890, "25%": 828.314, "50%": 828.711, "75%": 829.166, "90%": 829.666, "99%": 830.788, "99.9%": 831.793, "99.99%": 834.588 }
percentiles:
{"percentiles": [ 826.890, 827.302, 827.486, 827.601, 827.687, 827.757, 827.814, 827.863, 827.907, 827.947, 827.982, 828.013, 828.042, 828.071, 828.097, 828.122, 828.146, 828.169, 828.191, 828.214, 828.235, 828.256, 828.274, 828.294, 828.314, 828.331, 828.348, 828.366, 828.383, 828.399, 828.416, 828.433, 828.449, 828.466, 828.482, 828.497, 828.513, 828.528, 828.544, 828.559, 828.575, 828.591, 828.606, 828.621, 828.636, 828.651, 828.666, 828.681, 828.696, 828.711, 828.726, 828.741, 828.756, 828.772, 828.789, 828.806, 828.822, 828.838, 828.854, 828.871, 828.888, 828.906, 828.924, 828.941, 828.959, 828.978, 828.998, 829.017, 829.036, 829.057, 829.078, 829.099, 829.121, 829.143, 829.166, 829.189, 829.214, 829.239, 829.266, 829.294, 829.323, 829.353, 829.383, 829.417, 829.452, 829.490, 829.530, 829.571, 829.616, 829.666, 829.720, 829.778, 829.846, 829.923, 830.015, 830.126, 830.269, 830.459, 830.788, 835.022]}

8 workers
Running 15m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   414.35ms    4.96ms 426.36ms   99.61%
    Req/Sec     1.91      0.29    10.00     91.10%
  138946 requests in 15.00m, 45.45MB read
Requests/sec:    154.37
Transfer/sec:     51.71KB
latency_values:
{"Min": 53.073, "Max": 426.357, "Avg": 414.353, "Stdev": 4.956}
request_values:
{"Min": 1, "Max": 10, "Avg": 1, "Stdev": 0}
latency_distribution:
{"1%": 413.191, "25%": 414.068, "50%": 414.413, "75%": 414.762, "90%": 415.102, "99%": 415.817, "99.9%": 421.739, "99.99%": 425.706 }
percentiles:
{"percentiles": [ 413.191, 413.369, 413.467, 413.537, 413.589, 413.635, 413.675, 413.711, 413.742, 413.772, 413.799, 413.823, 413.846, 413.868, 413.889, 413.909, 413.929, 413.948, 413.966, 413.984, 414.001, 414.019, 414.035, 414.052, 414.068, 414.084, 414.099, 414.114, 414.129, 414.144, 414.159, 414.173, 414.187, 414.202, 414.216, 414.229, 414.243, 414.257, 414.270, 414.284, 414.297, 414.310, 414.323, 414.336, 414.349, 414.362, 414.374, 414.387, 414.400, 414.413, 414.426, 414.439, 414.452, 414.464, 414.477, 414.490, 414.503, 414.516, 414.529, 414.543, 414.557, 414.570, 414.584, 414.598, 414.611, 414.625, 414.639, 414.654, 414.668, 414.684, 414.699, 414.714, 414.730, 414.746, 414.762, 414.780, 414.797, 414.815, 414.833, 414.853, 414.874, 414.895, 414.915, 414.938, 414.961, 414.985, 415.012, 415.040, 415.070, 415.102, 415.138, 415.178, 415.224, 415.276, 415.337, 415.412, 415.503, 415.625, 415.817, 426.357]}

16 workers
Running 15m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   207.29ms    2.06ms 250.99ms   92.26%
    Req/Sec     4.77      0.56    10.00     84.15%
  277672 requests in 15.00m, 90.83MB read
Requests/sec:    308.49
Transfer/sec:    103.33KB
latency_values:
{"Min": 53.758, "Max": 250.993, "Avg": 207.286, "Stdev": 2.061}
request_values:
{"Min": 3, "Max": 10, "Avg": 4, "Stdev": 0}
latency_distribution:
{"1%": 206.075, "25%": 206.756, "50%": 207.044, "75%": 207.377, "90%": 208.238, "99%": 210.883, "99.9%": 216.863, "99.99%": 246.903 }
percentiles:
{"percentiles": [ 206.075, 206.203, 206.277, 206.331, 206.374, 206.410, 206.440, 206.469, 206.494, 206.517, 206.538, 206.557, 206.576, 206.594, 206.612, 206.629, 206.645, 206.660, 206.675, 206.689, 206.703, 206.717, 206.730, 206.743, 206.756, 206.769, 206.782, 206.794, 206.806, 206.818, 206.830, 206.841, 206.853, 206.864, 206.875, 206.886, 206.898, 206.909, 206.920, 206.931, 206.942, 206.954, 206.964, 206.976, 206.987, 206.998, 207.009, 207.021, 207.032, 207.044, 207.056, 207.067, 207.079, 207.091, 207.103, 207.115, 207.126, 207.138, 207.150, 207.162, 207.175, 207.188, 207.201, 207.213, 207.227, 207.241, 207.255, 207.269, 207.283, 207.298, 207.312, 207.328, 207.343, 207.359, 207.377, 207.395, 207.414, 207.434, 207.457, 207.480, 207.508, 207.538, 207.572, 207.611, 207.658, 207.713, 207.775, 207.850, 207.953, 208.238, 208.767, 209.239, 209.582, 209.863, 210.095, 210.291, 210.489, 210.682, 210.883, 250.993]}

32 workers
Running 15m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   103.79ms  834.64us 123.52ms   85.11%
    Req/Sec     9.79      0.98    10.00     96.24%
  554177 requests in 15.00m, 181.28MB read
Requests/sec:    615.68
Transfer/sec:    206.23KB
latency_values:
{"Min": 53.148, "Max": 123.520, "Avg": 103.793, "Stdev": 0.835}
request_values:
{"Min": 4, "Max": 10, "Avg": 9, "Stdev": 0}
latency_distribution:
{"1%": 102.888, "25%": 103.335, "50%": 103.645, "75%": 104.083, "90%": 104.768, "99%": 105.538, "99.9%": 105.840, "99.99%": 117.238 }
percentiles:
{"percentiles": [ 102.888, 102.952, 102.996, 103.028, 103.055, 103.077, 103.098, 103.117, 103.134, 103.150, 103.166, 103.180, 103.194, 103.208, 103.220, 103.232, 103.244, 103.256, 103.268, 103.279, 103.290, 103.301, 103.312, 103.324, 103.335, 103.346, 103.357, 103.368, 103.380, 103.391, 103.402, 103.414, 103.425, 103.437, 103.449, 103.461, 103.473, 103.485, 103.498, 103.511, 103.523, 103.536, 103.550, 103.563, 103.576, 103.590, 103.603, 103.617, 103.631, 103.645, 103.659, 103.673, 103.687, 103.701, 103.716, 103.730, 103.745, 103.759, 103.773, 103.788, 103.801, 103.814, 103.826, 103.838, 103.851, 103.863, 103.877, 103.892, 103.910, 103.930, 103.955, 103.982, 104.012, 104.046, 104.083, 104.124, 104.166, 104.209, 104.254, 104.301, 104.350, 104.397, 104.441, 104.485, 104.528, 104.571, 104.616, 104.663, 104.714, 104.768, 104.824, 104.887, 104.955, 105.029, 105.114, 105.209, 105.308, 105.412, 105.538, 123.520]}

64 workers
Running 15m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    52.46ms  318.21us  77.83ms   84.05%
    Req/Sec    19.02      2.95    20.00     90.36%
  1094791 requests in 15.00m, 358.12MB read
Requests/sec:   1216.30
Transfer/sec:    407.41KB
latency_values:
{"Min": 51.641, "Max": 77.826, "Avg": 52.464, "Stdev": 0.318}
request_values:
{"Min": 9, "Max": 20, "Avg": 19, "Stdev": 2}
latency_distribution:
{"1%": 52.001, "25%": 52.298, "50%": 52.423, "75%": 52.561, "90%": 52.751, "99%": 53.647, "99.9%": 55.004, "99.99%": 59.909 }
percentiles:
{"percentiles": [ 52.001, 52.045, 52.073, 52.095, 52.113, 52.129, 52.143, 52.156, 52.169, 52.180, 52.191, 52.201, 52.211, 52.220, 52.228, 52.236, 52.244, 52.252, 52.259, 52.266, 52.273, 52.280, 52.286, 52.292, 52.298, 52.304, 52.309, 52.315, 52.320, 52.325, 52.331, 52.336, 52.341, 52.346, 52.351, 52.356, 52.361, 52.366, 52.371, 52.376, 52.380, 52.385, 52.390, 52.395, 52.400, 52.404, 52.409, 52.414, 52.419, 52.423, 52.428, 52.433, 52.437, 52.442, 52.447, 52.452, 52.456, 52.461, 52.466, 52.471, 52.476, 52.481, 52.486, 52.491, 52.496, 52.501, 52.507, 52.513, 52.519, 52.525, 52.532, 52.538, 52.545, 52.553, 52.561, 52.569, 52.577, 52.586, 52.595, 52.605, 52.615, 52.626, 52.638, 52.651, 52.664, 52.679, 52.695, 52.711, 52.730, 52.751, 52.775, 52.802, 52.832, 52.870, 52.918, 52.987, 53.089, 53.260, 53.647, 77.826]}